fun main() {

}
// TODO:
//  добавить графический интерфейс (большую часть (2/3) окна занимает панель JPanel)
//  в этом прямоугольнике декартова система координат, по нажатию появляется точка (узел и значение)
//  и рисуется полином по этим узлам
//  в оставшейся нижней части (1/3) окна задаются максимальный x1, y1 и минимальный -x2, -y2, которые
//  задают размерность декартовой системы, и сделать еще че-то там в этой же части справа
//  первая панелька задает цвет точек (узлов), вторая цвет графика, третья цвет производной
//  (диалог выбора цвета при нажатии на панельку)